/*
Navicat MySQL Data Transfer

Source Server         : awesome
Source Server Version : 50723
Source Host           : interesting.zooori.cn:3306
Source Database       : resume

Target Server Type    : MYSQL
Target Server Version : 50723
File Encoding         : 65001

Date: 2019-08-29 16:21:00
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `info4resume`
-- ----------------------------
DROP TABLE IF EXISTS `info4resume`;
CREATE TABLE `info4resume` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `uid` int(8) DEFAULT '0' COMMENT '关联微信用户表id',
  `rid` varchar(32) DEFAULT '0' COMMENT '所属简历模板id',
  `sid` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '分享链接唯一id',
  `name` varchar(16) DEFAULT NULL COMMENT '名字',
  `objective` varchar(32) DEFAULT NULL COMMENT '求职意向',
  `gender` varchar(16) DEFAULT NULL COMMENT '性别',
  `birthday` varchar(16) DEFAULT NULL COMMENT '出生年月日',
  `age` tinyint(2) DEFAULT '0' COMMENT '年龄',
  `province` varchar(255) NOT NULL DEFAULT '',
  `city` varchar(255) NOT NULL DEFAULT '',
  `avatar` varchar(256) DEFAULT NULL COMMENT '图片链接',
  `signature` varchar(256) DEFAULT NULL COMMENT '个性签名',
  `phone` varchar(16) DEFAULT NULL,
  `email` varchar(32) DEFAULT NULL COMMENT '电子邮箱',
  `address` varchar(64) DEFAULT NULL COMMENT '现居住地址',
  `hobby` varchar(512) DEFAULT NULL COMMENT '兴趣爱好',
  `educations` varchar(1024) DEFAULT NULL COMMENT '教育经历，用 '','' 作为分割符',
  `works` varchar(1024) DEFAULT NULL COMMENT '工作经历，用 '','' 作为分割符',
  `projects` varchar(1024) DEFAULT NULL COMMENT '项目经历，用 '','' 作为分割符',
  `skills` varchar(1024) DEFAULT NULL COMMENT '专业技能，用 '','' 作为分割符',
  `honors` varchar(1024) DEFAULT NULL COMMENT '奖项荣誉，用 '','' 作为分割符',
  `introduce` varchar(512) DEFAULT NULL COMMENT '自我评价',
  `rumors` varchar(512) DEFAULT NULL COMMENT '人生箴言',
  `bg_img` varchar(128) DEFAULT NULL COMMENT '首屏背景图',
  `theme_color` varchar(16) DEFAULT NULL COMMENT '主题风格色值',
  `tailor_url` varchar(255) NOT NULL DEFAULT '',
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uid2rid` (`uid`,`rid`),
  UNIQUE KEY `share` (`sid`)
) ENGINE=InnoDB AUTO_INCREMENT=62 DEFAULT CHARSET=utf8 COMMENT='记录用户所选模板及用户简历基础信息';

-- ----------------------------
-- Records of info4resume
-- ----------------------------
INSERT INTO `info4resume` VALUES ('29', '1', 'YkzAZfmMTLwjHnIL', 'QWQwWjXjNbswCOmAKsXA', '范声林', 'Java Web开发工程师', '男', '1991-11-29', '0', '福建省', '南平市', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统<br/>2.环卫餐厨信息管理系统(包含客户端APP开发)<br/>3.固定资产管理系统(包含微信网页端开发)<br/>4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '#5991FF', '', '2018-11-29 16:11:08', '2018-11-08 02:49:35');
INSERT INTO `info4resume` VALUES ('30', '1', 'gQcbVwFtTDLveWfj', 'heWfTJAKqArvTetgYmpg', '范声林', 'Java Web开发工程师', '男', '1991-11-29', '0', '福建省', '南平市', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统\\n2.环卫餐厨信息管理系统(包含客户端APP开发)\\n3.固定资产管理系统(包含微信网页端开发)\\n4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '', '', '2018-11-07 10:51:23', '2018-11-07 10:51:23');
INSERT INTO `info4resume` VALUES ('31', '1', 'PqKRhTYTobYPZVPO', 'bMLlkHztgDeOpNrGgHXN', '范声林', 'Java Web开发工程师', '男', '1991-11-29', '0', '福建省', '南平市', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统<br/>2.环卫餐厨信息管理系统(包含客户端APP开发)<br/>3.固定资产管理系统(包含微信网页端开发)<br/>4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '#6195FF', '', '2019-01-10 11:33:05', '2018-11-07 18:51:28');
INSERT INTO `info4resume` VALUES ('32', '1', 'JGOPYSiUOgiqyOWP', 'aOFtVnzFVatDmEZkdiVP', '范声林', 'Java Web开发工程师', '男', '1991-11-29', '0', '福建省', '南平市', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统\\n2.环卫餐厨信息管理系统(包含客户端APP开发)\\n3.固定资产管理系统(包含微信网页端开发)\\n4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '', '', '2018-11-07 10:51:40', '2018-11-07 10:51:40');
INSERT INTO `info4resume` VALUES ('33', '1', 'mmhpHCWMxWnUcprZ', 'BCjxxOovmuMRjJizzckH', '范声林', 'Java Web开发工程师', '男', '1991-11-29', '0', '福建省', '南平市', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统<br/>2.环卫餐厨信息管理系统(包含客户端APP开发)<br/>3.固定资产管理系统(包含微信网页端开发)<br/>4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '#6195FF', 'test', '2019-01-10 11:29:27', '2018-11-09 15:55:08');
INSERT INTO `info4resume` VALUES ('34', '7', 'mmhpHCWMxWnUcprZ', 'hOSgTZtOLbDhfmfSogZB', '拒绝啦咯了', '具体看具体', '男', '2013-01-01', '0', '内蒙古自治区', '呼伦贝尔市', '', '', '18388558566', '我看啦咯啦咯啦啦', '拒绝具体聊咯了', '拒绝就拒绝啦咯了', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"\",\"description\":\"\"}]', '[{\"start\":\"2009-01\",\"end\":\"2014-01\",\"company\":\"UK图理论五天记录了\",\"position\":\"提路口了我在真转咯\",\"description\":\"具体哦呦喂考虑咯哦啦\"},{\"start\":\"1993-01\",\"end\":\"2008-01\",\"company\":\"他坑来来啦来\",\"position\":\"骨头看咯看结局了\",\"description\":\"图阿姐在我那里\"}]', '', '[{\"name\":\"UK我就快啦吧KKK\",\"num\":\"100\"},{\"name\":\"乱我就\",\"num\":\"86\"},{\"name\":\"Tony路了\",\"num\":\"75\"}]', '', '拒绝就拒绝啦咯了', '', '', '', '', '2018-11-09 08:58:27', '2018-11-09 04:50:36');
INSERT INTO `info4resume` VALUES ('35', '8', 'mmhpHCWMxWnUcprZ', 'DMCSphiiSRkcKBFewluh', 'test01', '设计师', '女', '2003-01-01', '0', '上海市', '上海市市辖区', '', '', '13922305912', 'imsprojo2fan@foxmail.com', '黄埔大道', '摄影唱歌', '', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"线路图\",\"position\":\"突突突\",\"description\":\"KTV咯www\"},{\"start\":\"2016-01\",\"end\":\"2016-01\",\"company\":\"那么好玩有限公司\",\"position\":\"设计师\",\"description\":\"做一些设计\"}]', '', '[{\"name\":\"Photoshop\",\"num\":\"100\"},{\"name\":\"Adobe\",\"num\":\"90\"}]', '', '有时细心', '', '', '', '', '2018-11-09 09:25:04', '2018-11-09 09:25:04');
INSERT INTO `info4resume` VALUES ('36', '9', 'GQMsSFuqABQpaLXS', 'XfvonFmpBlGlMasJypdo', '看风了风', '设计师', '女', '2001-01-01', '0', '北京市', '北京市市辖区', '', '', '13641531654', 'test@qq.com', '金山小区', '听音乐看电影运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2016-07\",\"end\":\"2018-12\",\"company\":\"厦门牧云数据技术有限公司\",\"position\":\"JavaWeb开发、安卓APP开发等\",\"description\":\"1.渗滤液信息管理系统<br/>2.环卫餐厨信息管理系统(包含客户端APP开发)<br/>3.固定资产管理系统(包含微信网页端开发)<br/>4.汇恒环保系统(包含视频服务器开发、nginx开发)\"},{\"start\":\"2015-07\",\"end\":\"2016-06\",\"company\":\"蓝蕾科技有限公司\",\"position\":\"JavaWeb开发工程师\",\"description\":\"负责已有系统二次开发，跟进需求实现代码功能，优化已有功能，完成项目发布与测试等\"},{\"start\":\"2014-01\",\"end\":\"2015-06\",\"company\":\"广州天诺营销策划有限公司\",\"position\":\"线路经理\",\"description\":\"负责汽车展会活动安排，及工作进度跟进，与客户沟通协商活动事宜\"}]', '', '[{\"name\":\"Java开发\",\"num\":\"84\"},{\"name\":\"前端网页开发(含移动端适配)\",\"num\":\"86\"},{\"name\":\"GoLang服务端开发\",\"num\":\"82\"},{\"name\":\"安卓App开发\",\"num\":\"75\"},{\"name\":\"小程序开发\",\"num\":\"82\"}]', '41651651', '能够清楚认识自己、有规划，做事认真细心有耐心，积极上进，为人平和', '', '', '#92d050', '', '2018-11-14 16:16:44', '2018-11-14 16:16:44');
INSERT INTO `info4resume` VALUES ('37', '10', 'mmhpHCWMxWnUcprZ', 'WVBvZEqbPLysmiZlqhyO', '陈雨', '会计', '女', '1995-02-17', '0', '江苏省', '盐城市', '', '', '18306178806', '894355679@qq.com', '东台', '听歌，弹琵琶', '', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"\",\"position\":\"\",\"description\":\"\"},{\"start\":\"2018-07\",\"end\":\"2018-10\",\"company\":\"东台稠州村镇银行\",\"position\":\"柜员\",\"description\":\"\"}]', '', '[{\"name\":\"计算机二级\",\"num\":\"75\"},{\"name\":\"\",\"num\":\"75\"}]', '', '乐观，开朗', '', '', '', '', '2018-11-14 19:20:32', '2018-11-14 19:20:32');
INSERT INTO `info4resume` VALUES ('38', '0', 'GQMsSFuqABQpaLXS', 'YonBiAYRZGDLKefTPsnK', '看风了风', '设计师', '女', '2000-01-01', '0', '福建省', '厦门市', '', '', '13656523236', 'test@qq.com', '思明区中华城', '看电影、听音乐运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2015-01\",\"end\":\"2018-01\",\"company\":\"厦门某影视公司\",\"position\":\"影视设计师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2014-01\",\"end\":\"2015-01\",\"company\":\"厦门某影视公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2013-01\",\"end\":\"2014-01\",\"company\":\"厦门某影视公司\",\"position\":\"摄影师助理\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"80\"},{\"name\":\"英语四级证书\",\"num\":\"100\"}]', '校级优秀学生干部、三好学生标兵、国家励志奖学金、校级一等奖学金', '本人性格热情开朗，待人友好，为人诚实谦虚。工作勤奋，认真负责，能吃苦耐劳，尽职尽责。具有亲和力、平易近人，善于与人沟通。\n学习刻苦认真，成绩优秀，名列前茅。品学兼优连续三年获得学校奖学金。曾担任学生会外联部干部、系团组织部部长、班级生活委员等。', '', '', '#7B68EE', '', '2018-11-15 09:35:23', '2018-11-15 09:35:23');
INSERT INTO `info4resume` VALUES ('39', '11', 'GQMsSFuqABQpaLXS', 'BkuWIMeTCDSsGpJBJyEU', '看风了风', '摄影师', '女', '1996-01-01', '0', '北京市', '北京市市辖区', '', '', '13656545641', 'test@qq.com', '海淀区', '摄影、旅游、音乐、电影、运动等', '[{\"start\":\"2011-09\",\"end\":\"2014-07\",\"school\":\"广州番禺理工学院\",\"description\":\"大学阶段\"},{\"start\":\"2008-09\",\"end\":\"2011-07\",\"school\":\"顺昌第一中学\",\"description\":\"高中阶段\"}]', '[{\"start\":\"2017-01\",\"end\":\"2018-12\",\"company\":\"才华有限公司\",\"position\":\"首席摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2014-01\",\"end\":\"2016-12\",\"company\":\"才华有限公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2011-01\",\"end\":\"2013-12\",\"company\":\"才华有限公司\",\"position\":\"摄影助理\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"100\"},{\"name\":\"英语四级证书\",\"num\":\"94\"},{\"name\":\"普通话二级甲等\",\"num\":\"84\"}]', '', '本人性格热情开朗，待人友好，为人诚实谦虚。工作勤奋，认真负责，能吃苦耐劳，尽职尽责。具有亲和力、平易近人，善于与人沟通。\n学习刻苦认真，成绩优秀，名列前茅。品学兼优连续三年获得学校奖学金。曾担任学生会外联部干部、系团组织部部长、班级生活委员等。', '', '', '#7F5CFF', '', '2018-11-15 11:22:14', '2018-11-16 02:12:25');
INSERT INTO `info4resume` VALUES ('40', '13', 'GQMsSFuqABQpaLXS', 'CfawDjKvNtCcWZVSiQQb', '65156', '6541651', '男', '2018-01-01', '0', '北京市', '北京市市辖区', '', '', '13651513131', 'test@qq.com', '6416516', '654155', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"5741654165\",\"description\":\"6146514654156\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"486416516\",\"position\":\"65416514\",\"description\":\"65165156\"}]', '', '[{\"name\":\"8641651\",\"num\":\"84\"}]', '14651313', '1653131468415', '', '', '#7B68EE', '', '2018-11-15 10:31:58', '2018-11-15 10:31:58');
INSERT INTO `info4resume` VALUES ('41', '14', 'cDFOKyWiBxzLueSd', 'tOXgWacIkpCmHNARjUFU', '看风了风', '设计师233', '男', '2018-01-01', '0', '福建省', '厦门市', '', '', '13613465131', 'test@qq.com', '思明区', '看电影等', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"89641641\",\"description\":\"651651465\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"641615\",\"description\":\"65146541684165\"}]', '[{\"start\":\"2017-01\",\"end\":\"2018-01\",\"company\":\"685614\",\"position\":\"1654165165\",\"description\":\"4164165\"},{\"start\":\"2015-01\",\"end\":\"2016-01\",\"company\":\"6541561\",\"position\":\"1563202\",\"description\":\"13313512\"}]', '', '[{\"name\":\"英语四级\",\"num\":\"94\"},{\"name\":\"计算机四级\",\"num\":\"100\"}]', '666', '646651163113115', '', '', '#26FF8B', '', '2018-11-22 15:29:11', '2018-11-22 15:29:11');
INSERT INTO `info4resume` VALUES ('42', '15', 'EtGlAyNqhNDVhTNr', 'nOSvYHLXDuhNaeTUZeqg', '看风了风', '设计师', '男', '2018-01-01', '0', '福建省', '厦门市', '', '', '13646151651', 'test@qq.com', '巴拉巴拉小魔仙', '看电影听音乐等', '[{\"start\":\"2012-01\",\"end\":\"2016-01\",\"school\":\"即刻大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"},{\"start\":\"2009-01\",\"end\":\"2012-01\",\"school\":\"才华大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"}]', '[{\"start\":\"2014-01\",\"end\":\"2015-01\",\"company\":\"才华有限公司\",\"position\":\"设计师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2016-01\",\"end\":\"2016-01\",\"company\":\"才华有限公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2017-01\",\"end\":\"2018-01\",\"company\":\"才华有限公司\",\"position\":\"首席摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"85\"},{\"name\":\"英语四级证书\",\"num\":\"100\"},{\"name\":\"普通话二级甲等\",\"num\":\"75\"}]', '', '工作认真', '', '', '#7B68EE', '', '2018-11-23 14:49:13', '2018-11-23 14:49:13');
INSERT INTO `info4resume` VALUES ('43', '16', 'mmhpHCWMxWnUcprZ', 'ecBspMoJMwJxcQwbHNDq', '55646416', '641654156', '男', '2018-01-01', '0', '河北省', '秦皇岛市', '', '', '13646515615', 'test@qq.com', '646541', '4165416514', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"89489+48\",\"description\":\"8947874\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"8798486\",\"description\":\"9849865\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"6541561\",\"position\":\"1511\",\"description\":\"551515\"}]', '', '[{\"name\":\"785468468\",\"num\":\"75\"},{\"name\":\"848686\",\"num\":\"75\"},{\"name\":\"849641684\",\"num\":\"75\"}]', '416541561', '641654165', '', '', '#54FF71', '', '2018-11-23 17:18:21', '2018-11-23 17:18:21');
INSERT INTO `info4resume` VALUES ('44', '17', 'YkzAZfmMTLwjHnIL', 'JYcrRZwnGVUrWnKNDtke', '看风了风', '摄影师', '男', '2018-01-10', '0', '福建省', '厦门市', '', '', '13646135115', 'test@qq.com', '思明区', '看电影，听音乐运动等', '[{\"start\":\"2014-01\",\"end\":\"2017-01\",\"school\":\"即刻大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"才华大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"}]', '[{\"start\":\"2016-01\",\"end\":\"2017-01\",\"company\":\"才华有限公司\",\"position\":\"摄影师助理\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2017-01\",\"end\":\"2018-01\",\"company\":\"才华有限公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"88\"},{\"name\":\"英语四级证书\",\"num\":\"100\"},{\"name\":\"普通话二级甲等\",\"num\":\"90\"}]', '校级优秀学生干部、三好学生标兵、国家励志奖学金、校级一等奖学金、国家励志奖学金、校级二等奖学金、校级优秀学生干部', '本人性格热情开朗，待人友好，为人诚实谦虚。工作勤奋，认真负责，能吃苦耐劳，尽职尽责。具有亲和力、平易近人，善于与人沟通。\n学习刻苦认真，成绩优秀，名列前茅。品学兼优连续三年获得学校奖学金。曾担任学生会外联部干部、系团组织部部长、班级生活委员等。', '', '', '#7030a0', '', '2018-11-29 15:58:55', '2018-11-29 15:58:55');
INSERT INTO `info4resume` VALUES ('45', '18', 'gQcbVwFtTDLveWfj', 'hCmzLApBgwqpzVIrrecg', '看风了风', '摄影师', '男', '1995-01-01', '0', '福建省', '厦门市', '', '', '13656545641', 'test@qq.com', '海淀区', '摄影、旅游、音乐、电影、运动等', '[{\"start\":\"2012-01\",\"end\":\"2016-01\",\"school\":\"即刻大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"},{\"start\":\"2009-01\",\"end\":\"2012-01\",\"school\":\"才华大学\",\"description\":\"主修课程：<br/>传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"}]', '[{\"start\":\"2011-01\",\"end\":\"2013-01\",\"company\":\"才华有限公司\",\"position\":\"摄影助理\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2014-01\",\"end\":\"2016-01\",\"company\":\"才华有限公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2017-01\",\"end\":\"2018-01\",\"company\":\"才华有限公司\",\"position\":\"首席摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；<br/>根据工作需要，挑选合适的摄影设备；<br/>根据导演要求，运用摄影艺术手段完成影视片的电影造型；<br/>在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；<br/>与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"100\"},{\"name\":\"英语四级证书\",\"num\":\"91\"},{\"name\":\"普通话二级甲等\",\"num\":\"85\"}]', '校级优秀学生干部、三好学生标兵、国家励志奖学金、校级一等奖学金、国家励志奖学金、校级二等奖学金、校级优秀学生干部', '本人性格热情开朗，待人友好，为人诚实谦虚。工作勤奋，认真负责，能吃苦耐劳，尽职尽责。具有亲和力、平易近人，善于与人沟通。\n学习刻苦认真，成绩优秀，名列前茅。品学兼优连续三年获得学校奖学金。曾担任学生会外联部干部、系团组织部部长、班级生活委员等。', '', '', '#92d050', '', '2018-12-07 10:46:35', '2018-12-07 10:46:35');
INSERT INTO `info4resume` VALUES ('46', '19', 'PqKRhTYTobYPZVPO', 'LmTXXZAFJXaqLeTmuleX', '看风了风', '摄影师', '男', '1995-01-01', '0', '福建省', '厦门市', '', '', '13656545641', 'test@qq.com', '思明区', '摄影、旅游、音乐、电影、运动等', '[{\"start\":\"2011-01\",\"end\":\"2018-01\",\"school\":\"即刻大学\",\"description\":\"主修课程：\\n传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"},{\"start\":\"2013-01\",\"end\":\"2018-01\",\"school\":\"才华大学\",\"description\":\"主修课程：\\n传统动画原理，角色设计，场景设计，广告设计，视听语言，表演，脚本创作，影视场景建模，三维角色动画，影视材质特效等。素描、色彩、平面构成、色彩构成立体构成、图案、电脑平面设计、电脑三维设计、多媒体技术合成，电脑绘画，电脑三维绘画。\"}]', '[{\"start\":\"2017-01\",\"end\":\"2018-01\",\"company\":\"才华有限公司\",\"position\":\"首席摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；\\n根据工作需要，挑选合适的摄影设备；\\n根据导演要求，运用摄影艺术手段完成影视片的电影造型；\\n在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；\\n与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2014-01\",\"end\":\"2016-01\",\"company\":\"才华有限公司\",\"position\":\"摄影师\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；\\n根据工作需要，挑选合适的摄影设备；\\n根据导演要求，运用摄影艺术手段完成影视片的电影造型；\\n在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；\\n与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"},{\"start\":\"2011-01\",\"end\":\"2013-01\",\"company\":\"才华有限公司\",\"position\":\"摄影助理\",\"description\":\"根据拍摄人物，制定详细的拍摄工作计划与时间安排；\\n根据工作需要，挑选合适的摄影设备；\\n根据导演要求，运用摄影艺术手段完成影视片的电影造型；\\n在完成拍摄任务的整个过程中，与拍摄小组其他成员紧密协作；\\n与被拍摄者沟通，以达到快速进入拍摄状态的效果。\"}]', '', '[{\"name\":\"摄影师证书\",\"num\":\"100\"},{\"name\":\"英语四级证书\",\"num\":\"90\"},{\"name\":\"普通话二级甲等\",\"num\":\"88\"}]', '校级优秀学生干部、三好学生标兵、国家励志奖学金、校级一等奖学金、国家励志奖学金、校级二等奖学金、校级优秀学生干部', '本人性格热情开朗，待人友好，为人诚实谦虚。工作勤奋，认真负责，能吃苦耐劳，尽职尽责。具有亲和力、平易近人，善于与人沟通。\n学习刻苦认真，成绩优秀，名列前茅。品学兼优连续三年获得学校奖学金。曾担任学生会外联部干部、系团组织部部长、班级生活委员等。', '', '', '#92d050', '', '2018-12-29 11:27:15', '2018-12-29 11:27:15');
INSERT INTO `info4resume` VALUES ('47', '20', 'PqKRhTYTobYPZVPO', 'JRfhjcyDoZGysYbBqtPi', 'cc', 'html', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '15132362556', '4546526356@qq.com', '福州', '唱歌', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"科技\",\"description\":\"啊啊啊啊\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"文化\",\"position\":\"程序员\",\"description\":\"打代码\"}]', '', '[{\"name\":\"css\",\"num\":\"60\"}]', '无', '良好', '', '', '#6195FF', '', '2019-01-10 11:38:34', '2019-01-10 11:38:34');
INSERT INTO `info4resume` VALUES ('48', '21', 'EtGlAyNqhNDVhTNr', 'aNDnLkHmMtfGGjFCMkPd', '1', '1', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13459934647', '1123332@qq.com', '1', '1', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"3\",\"description\":\"3\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"2\",\"position\":\"2\",\"description\":\"2\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"1\",\"position\":\"1\",\"description\":\"1\"}]', '', '[{\"name\":\"1\",\"num\":\"91\"},{\"name\":\"2\",\"num\":\"90\"},{\"name\":\"4\",\"num\":\"74\"}]', '1', '1', '', '', '#7B68EE', '', '2019-01-10 11:57:06', '2019-01-10 11:57:06');
INSERT INTO `info4resume` VALUES ('49', '22', 'PqKRhTYTobYPZVPO', 'mIpTvOgRnggUXFSnjaBo', '234', '2', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13459934647', '123@qq.com', '福州', '2', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"7\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"9\",\"description\":\"8\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"6\",\"position\":\"6\",\"description\":\"6\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"3\",\"position\":\"4\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"d\",\"position\":\"d\",\"description\":\"3\"}]', '', '[{\"name\":\"7\",\"num\":\"54\"},{\"name\":\"8\",\"num\":\"63\"}]', '2', '3', '', '', '#c0504d', '', '2019-01-10 12:43:38', '2019-01-10 12:43:38');
INSERT INTO `info4resume` VALUES ('50', '22', 'mmhpHCWMxWnUcprZ', 'agsHuUZsgISGnbQjnWlu', '234', '2', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13459934647', '123@qq.com', '福州', '2', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"7\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"9\",\"description\":\"8\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"6\",\"position\":\"6\",\"description\":\"6\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"3\",\"position\":\"4\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"d\",\"position\":\"d\",\"description\":\"3\"}]', '', '[{\"name\":\"7\",\"num\":\"54\"},{\"name\":\"8\",\"num\":\"63\"}]', '2', '3', '', '', '#c0504d', '', '2019-01-10 12:43:38', '2019-01-10 12:43:38');
INSERT INTO `info4resume` VALUES ('51', '22', 'MikEsjhshAKtmTjx', 'JjkjtAfXigwyCQRRqwXf', '234', '2', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13459934647', '123@qq.com', '福州', '2', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"7\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"9\",\"description\":\"8\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"6\",\"position\":\"6\",\"description\":\"6\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"3\",\"position\":\"4\",\"description\":\"5\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"d\",\"position\":\"d\",\"description\":\"3\"}]', '', '[{\"name\":\"7\",\"num\":\"54\"},{\"name\":\"8\",\"num\":\"63\"}]', '2', '3', '', '', '#c0504d', '', '2019-01-10 14:15:35', '2019-01-10 14:15:35');
INSERT INTO `info4resume` VALUES ('52', '23', 'mmhpHCWMxWnUcprZ', 'hTatbWcCCiJQPKzYRaVQ', '1', '1', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13459934647', '55@qq.com', 'e', 'e', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"e\",\"description\":\"e\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"e\",\"position\":\"e\",\"description\":\"e\"}]', '', '[{\"name\":\"e\",\"num\":\"75\"}]', 'e', 'e', '', '', '#6195FF', '', '2019-01-10 14:28:14', '2019-01-10 14:28:14');
INSERT INTO `info4resume` VALUES ('53', '24', 'mmhpHCWMxWnUcprZ', 'bWLxHqmLgKWfAVsanyln', '范范', '684456', '女', '2018-01-05', '0', '北京市', '北京城区', '', '', '13333333333', 'test@qq.com', '55135', '', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"4641658964\",\"description\":\"\"},{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"6561\",\"description\":\"\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"86416516\",\"position\":\"846\",\"description\":\"8641641561\"}]', '', '[]', '', '655415616', '', '', '#6195FF', '', '2019-01-10 14:56:49', '2019-01-10 14:56:49');
INSERT INTO `info4resume` VALUES ('54', '25', 'mmhpHCWMxWnUcprZ', 'IWoiahxrGxckGVyoLgTf', '84168', '64641', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646416165', 'test@qq.com', '54165', '61651', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"4654165\",\"description\":\"64164165\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"465165\",\"position\":\"651651\",\"description\":\"6146416\"}]', '', '[{\"name\":\"54156\",\"num\":\"75\"}]', '651', '65165165', '', '', '#6195FF', '', '2019-01-12 10:42:31', '2019-01-12 10:42:31');
INSERT INTO `info4resume` VALUES ('55', '26', 'mmhpHCWMxWnUcprZ', 'sDNrznFQgCnyGfMjcvWs', '8416651', '6841641658', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13655615165', 'test@qq.com', '41516', '68416416', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"784894198\",\"description\":\"489488\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"89641685\",\"position\":\"641654165\",\"description\":\"1651465\"}]', '', '[{\"name\":\"41848\",\"num\":\"75\"}]', '4641651', '4654165', '', '', '#6195FF', '', '2019-01-12 10:44:28', '2019-01-12 10:44:28');
INSERT INTO `info4resume` VALUES ('56', '27', 'mmhpHCWMxWnUcprZ', 'GANOnlgRgzEHcZfbjSda', '89468416', '64164658', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13645156165', 'test@qq.com', '8964684', '68416416', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"416\",\"description\":\"64164185\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"4641641\",\"position\":\"6541651465\",\"description\":\"654165\"}]', '', '[{\"name\":\"6418651\",\"num\":\"75\"}]', '869416841', '68416895', '', '', '#6195FF', '', '2019-01-12 10:45:50', '2019-01-12 10:45:50');
INSERT INTO `info4resume` VALUES ('57', '28', 'mmhpHCWMxWnUcprZ', 'dmkPZUSBIQSgSsanogud', '896165', '64164165', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646416416', 'test@qq.com', '89496486', '46416541', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"4741684\",\"description\":\"4986489\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"8416841\",\"position\":\"684641\",\"description\":\"64165\"}]', '', '[{\"name\":\"6841651\",\"num\":\"75\"}]', '64164', '6416848', '', '', '#6195FF', '', '2019-01-12 10:48:59', '2019-01-12 10:48:59');
INSERT INTO `info4resume` VALUES ('58', '29', 'mmhpHCWMxWnUcprZ', 'vyKMBTGqQloSSVSxIalX', '8964165', '6564165', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646416516', 'test@qq.com', '8468416', '64165', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"8964641\",\"description\":\"65165165\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"84841\",\"position\":\"4165416\",\"description\":\"464165\"}]', '', '[{\"name\":\"894894\",\"num\":\"75\"}]', '64416541', '64165', '', '', '#6195FF', '', '2019-01-12 10:51:56', '2019-01-12 10:51:56');
INSERT INTO `info4resume` VALUES ('59', '30', 'mmhpHCWMxWnUcprZ', 'zbkVYMOeiLlUIEdQXzyr', '8641651', '65165', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646516516', 'test@qq.com', '86454', '141864', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"86416841\",\"description\":\"641641658\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"896416841\",\"position\":\"6416416\",\"description\":\"41654165\"}]', '', '[{\"name\":\"894848\",\"num\":\"75\"}]', '8648641', '684658', '', '', '#6195FF', '', '2019-01-12 10:55:36', '2019-01-12 10:55:36');
INSERT INTO `info4resume` VALUES ('60', '31', 'mmhpHCWMxWnUcprZ', 'uVlGbygtcxWuQrUjGaQP', '616516', '6511651', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646541651', 'test@qq.com', '8416', '41641641', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"8948964\",\"description\":\"64698489\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"841641\",\"position\":\"6416\",\"description\":\"4164165\"}]', '', '[{\"name\":\"848645\",\"num\":\"75\"}]', '641684', '6416865', '', '', '#6195FF', '', '2019-01-12 10:58:02', '2019-01-12 10:58:02');
INSERT INTO `info4resume` VALUES ('61', '32', 'mmhpHCWMxWnUcprZ', 'BicstzYrDivadGLAnUoj', '46416', '65416465', '男', '2018-01-01', '0', '北京市', '北京城区', '', '', '13646514651', 'test@qq.com', '8941641', '641641', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"school\":\"4898486\",\"description\":\"641665\"}]', '[{\"start\":\"2018-01\",\"end\":\"2018-01\",\"company\":\"8964165\",\"position\":\"651651\",\"description\":\"6565156\"}]', '', '[{\"name\":\"479485\",\"num\":\"75\"}]', '6641665', '7541685', '', '', '#6195FF', '', '2019-01-12 11:04:48', '2019-01-12 11:04:48');

-- ----------------------------
-- Table structure for `message`
-- ----------------------------
DROP TABLE IF EXISTS `message`;
CREATE TABLE `message` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `uid` varchar(64) DEFAULT NULL COMMENT '用户id',
  `company` varchar(64) DEFAULT NULL,
  `name` varchar(32) DEFAULT NULL COMMENT '联系人名称',
  `phone` varchar(16) DEFAULT NULL COMMENT '电话号码',
  `email` varchar(16) DEFAULT NULL COMMENT '电子邮箱',
  `message` varchar(256) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL COMMENT '留言信息',
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='记录招聘公司一些信息';

-- ----------------------------
-- Records of message
-- ----------------------------
INSERT INTO `message` VALUES ('1', '8', '8641651', '', '', '5615', '5614654156', '2018-11-08 17:52:00', '2018-11-08 17:52:00');
INSERT INTO `message` VALUES ('2', '8', 'UK路他累', '', '', '啦咯啦咯啦咯', '卢卡库兔兔旅途', '2018-11-08 17:56:58', '2018-11-08 17:56:58');
INSERT INTO `message` VALUES ('3', '8', '才华邮箱公司', '范先生', '', '123@foxmail.com', '请速来面试', '2018-11-09 10:10:22', '2018-11-09 10:10:22');
INSERT INTO `message` VALUES ('4', '1', '11', '11', '', '11', '11', '2019-01-10 14:44:14', '2019-01-10 14:44:14');

-- ----------------------------
-- Table structure for `operate`
-- ----------------------------
DROP TABLE IF EXISTS `operate`;
CREATE TABLE `operate` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0' COMMENT '用户id',
  `rid` varchar(32) NOT NULL COMMENT '简历模板唯一识别码',
  `type` int(11) NOT NULL DEFAULT '0' COMMENT '0查看 1收藏 2制作',
  `updated` datetime NOT NULL,
  `created` datetime NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uid4rid` (`uid`,`rid`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='记录用户操作记录，喜欢、查看、制作';

-- ----------------------------
-- Records of operate
-- ----------------------------
INSERT INTO `operate` VALUES ('4', '1', 'mmhpHCWMxWnUcprZ', '2', '2018-11-06 11:19:26', '2018-11-06 11:19:26');
INSERT INTO `operate` VALUES ('12', '6', 'mmhpHCWMxWnUcprZ', '2', '2018-11-06 15:17:05', '2018-11-06 15:17:05');
INSERT INTO `operate` VALUES ('13', '1', 'GQMsSFuqABQpaLXS', '2', '2018-11-07 10:13:39', '2018-11-07 10:13:39');
INSERT INTO `operate` VALUES ('16', '1', 'cDFOKyWiBxzLueSd', '2', '2018-11-07 10:34:10', '2018-11-07 10:34:10');
INSERT INTO `operate` VALUES ('17', '1', 'EtGlAyNqhNDVhTNr', '2', '2018-11-07 10:43:46', '2018-11-07 10:43:46');
INSERT INTO `operate` VALUES ('18', '1', 'YkzAZfmMTLwjHnIL', '2', '2018-11-07 10:49:35', '2018-11-07 10:49:35');
INSERT INTO `operate` VALUES ('19', '1', 'gQcbVwFtTDLveWfj', '2', '2018-11-07 10:51:23', '2018-11-07 10:51:23');
INSERT INTO `operate` VALUES ('20', '1', 'PqKRhTYTobYPZVPO', '2', '2018-11-07 10:51:28', '2018-11-07 10:51:28');
INSERT INTO `operate` VALUES ('21', '1', 'JGOPYSiUOgiqyOWP', '2', '2018-11-07 10:51:40', '2018-11-07 10:51:40');
INSERT INTO `operate` VALUES ('23', '7', 'mmhpHCWMxWnUcprZ', '2', '2018-11-08 20:50:36', '2018-11-08 20:50:36');
INSERT INTO `operate` VALUES ('24', '8', 'mmhpHCWMxWnUcprZ', '2', '2018-11-09 09:25:04', '2018-11-09 09:25:04');
INSERT INTO `operate` VALUES ('25', '9', 'GQMsSFuqABQpaLXS', '2', '2018-11-14 16:16:47', '2018-11-14 16:16:47');
INSERT INTO `operate` VALUES ('26', '10', 'mmhpHCWMxWnUcprZ', '2', '2018-11-14 19:20:32', '2018-11-14 19:20:32');
INSERT INTO `operate` VALUES ('27', '0', 'GQMsSFuqABQpaLXS', '2', '2018-11-15 09:35:24', '2018-11-15 09:35:24');
INSERT INTO `operate` VALUES ('28', '11', 'GQMsSFuqABQpaLXS', '2', '2018-11-15 10:12:27', '2018-11-15 10:12:27');
INSERT INTO `operate` VALUES ('29', '13', 'GQMsSFuqABQpaLXS', '2', '2018-11-15 10:32:00', '2018-11-15 10:32:00');
INSERT INTO `operate` VALUES ('30', '14', 'cDFOKyWiBxzLueSd', '2', '2018-11-22 15:29:11', '2018-11-22 15:29:11');
INSERT INTO `operate` VALUES ('31', '15', 'EtGlAyNqhNDVhTNr', '2', '2018-11-23 14:49:13', '2018-11-23 14:49:13');
INSERT INTO `operate` VALUES ('32', '16', 'mmhpHCWMxWnUcprZ', '2', '2018-11-23 17:18:21', '2018-11-23 17:18:21');
INSERT INTO `operate` VALUES ('33', '17', 'YkzAZfmMTLwjHnIL', '2', '2018-11-29 15:58:55', '2018-11-29 15:58:55');
INSERT INTO `operate` VALUES ('34', '18', 'gQcbVwFtTDLveWfj', '2', '2018-12-07 10:46:35', '2018-12-07 10:46:35');
INSERT INTO `operate` VALUES ('35', '19', 'PqKRhTYTobYPZVPO', '2', '2018-12-29 11:27:15', '2018-12-29 11:27:15');
INSERT INTO `operate` VALUES ('36', '20', 'PqKRhTYTobYPZVPO', '2', '2019-01-10 11:38:34', '2019-01-10 11:38:34');
INSERT INTO `operate` VALUES ('37', '21', 'EtGlAyNqhNDVhTNr', '2', '2019-01-10 11:57:06', '2019-01-10 11:57:06');
INSERT INTO `operate` VALUES ('38', '22', 'PqKRhTYTobYPZVPO', '2', '2019-01-10 12:43:38', '2019-01-10 12:43:38');
INSERT INTO `operate` VALUES ('39', '22', 'mmhpHCWMxWnUcprZ', '2', '2019-01-10 14:12:48', '2019-01-10 14:12:48');
INSERT INTO `operate` VALUES ('40', '22', 'MikEsjhshAKtmTjx', '2', '2019-01-10 14:15:35', '2019-01-10 14:15:35');
INSERT INTO `operate` VALUES ('41', '23', 'mmhpHCWMxWnUcprZ', '2', '2019-01-10 14:28:14', '2019-01-10 14:28:14');
INSERT INTO `operate` VALUES ('42', '24', 'mmhpHCWMxWnUcprZ', '2', '2019-01-10 14:56:49', '2019-01-10 14:56:49');
INSERT INTO `operate` VALUES ('44', '25', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:42:31', '2019-01-12 10:42:31');
INSERT INTO `operate` VALUES ('45', '26', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:44:28', '2019-01-12 10:44:28');
INSERT INTO `operate` VALUES ('46', '27', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:45:50', '2019-01-12 10:45:50');
INSERT INTO `operate` VALUES ('47', '28', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:48:59', '2019-01-12 10:48:59');
INSERT INTO `operate` VALUES ('48', '29', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:51:57', '2019-01-12 10:51:57');
INSERT INTO `operate` VALUES ('49', '30', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:55:36', '2019-01-12 10:55:36');
INSERT INTO `operate` VALUES ('50', '31', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 10:58:02', '2019-01-12 10:58:02');
INSERT INTO `operate` VALUES ('51', '32', 'mmhpHCWMxWnUcprZ', '2', '2019-01-12 11:04:48', '2019-01-12 11:04:48');

-- ----------------------------
-- Table structure for `resume`
-- ----------------------------
DROP TABLE IF EXISTS `resume`;
CREATE TABLE `resume` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `eid` varchar(64) DEFAULT NULL,
  `name` varchar(32) DEFAULT NULL COMMENT '模板名称',
  `type` varchar(32) DEFAULT NULL COMMENT '模板类型',
  `theme` varchar(16) DEFAULT NULL COMMENT '主题样式',
  `url` varchar(32) DEFAULT NULL COMMENT '链接地址',
  `img` varchar(128) DEFAULT NULL COMMENT '缩略图',
  `tailor` varchar(2) DEFAULT '0' COMMENT '是否为个性化定制 0否 1是',
  `likes` int(8) DEFAULT '0',
  `views` int(8) DEFAULT '0',
  `mades` int(8) DEFAULT '0',
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COMMENT='简历模板基础信息';

-- ----------------------------
-- Records of resume
-- ----------------------------
INSERT INTO `resume` VALUES ('2', 'mmhpHCWMxWnUcprZ', '全屏简约个人主页模板', '类型一', '时尚创意', 'resume001', '1542965443.jpg', '0', '81', '887', '847', '2018-11-23 17:30:46', '2018-10-30 13:52:24');
INSERT INTO `resume` VALUES ('3', 'GQMsSFuqABQpaLXS', '时尚个人简历模板', '类型三', '时尚创意', 'resume001_', '1542098977.jpg', '0', '810', '951', '821', '2018-11-13 16:51:33', '2018-10-29 17:11:49');
INSERT INTO `resume` VALUES ('4', 'cDFOKyWiBxzLueSd', '侧边栏导航简历模板', '类型三', '现代商务', 'resume002', '1542360148.jpg', '0', '974', '836', '915', '2018-11-16 17:22:31', '2018-10-30 11:08:28');
INSERT INTO `resume` VALUES ('6', 'EtGlAyNqhNDVhTNr', '极简material风格个人简历模板', '类型四', '时尚创意', 'resume003', '1544154046.jpg', '0', '851', '937', '920', '2018-12-07 11:40:53', '2018-10-30 11:08:43');
INSERT INTO `resume` VALUES ('7', 'YkzAZfmMTLwjHnIL', '半屏风个人简历模板', '其他', '时尚创意', 'resume004', '1543478904.jpg', '0', '958', '948', '816', '2018-11-29 16:10:04', '2018-10-30 11:09:50');
INSERT INTO `resume` VALUES ('8', 'gQcbVwFtTDLveWfj', '简约风响应式简历模板', '类型一', '时尚创意', 'resume005', '1544154067.jpg', '0', '810', '951', '821', '2018-12-07 11:45:12', '2018-10-30 11:13:33');
INSERT INTO `resume` VALUES ('9', 'PqKRhTYTobYPZVPO', '简约风时尚模板', '类型二', '时尚创意', 'resume006', '1546411254.jpg', '0', '849', '884', '887', '2019-01-02 14:40:59', '2018-10-30 11:17:46');
INSERT INTO `resume` VALUES ('10', 'JGOPYSiUOgiqyOWP', 'test008', '类型三', '文艺清新', '', '1540951660.jpg', '0', '974', '836', '915', '2018-10-30 11:21:05', '2018-10-30 11:21:05');
INSERT INTO `resume` VALUES ('11', 'aycjPhHYDWnpXFJU', 'test009', '类型三', '其他风格', '', '1540951660.jpg', '0', '873', '968', '891', '2018-10-30 11:23:31', '2018-10-30 11:23:31');
INSERT INTO `resume` VALUES ('12', 'MikEsjhshAKtmTjx', 'test010', '类型四', '其他风格', '', '1540951660.jpg', '0', '990', '931', '873', '2018-10-30 11:25:39', '2018-10-30 11:25:39');
INSERT INTO `resume` VALUES ('13', 'kHslWPbgUDKAbrTW', 'test011', '类型一', '现代商务', '', '1540951660.jpg', '0', '956', '911', '837', '2018-10-30 11:26:35', '2018-10-30 11:26:35');
INSERT INTO `resume` VALUES ('14', 'tjodUOosJauJbgoS', 'test012', '类型二', '时尚创意', '', '1540951660.jpg', '0', '978', '909', '872', '2018-10-30 11:31:04', '2018-10-30 11:31:04');
INSERT INTO `resume` VALUES ('15', 'rzlzZxThKQdTjAAn', 'test013', '类型三', '经典大气', '', '1540951660.jpg', '0', '850', '988', '971', '2018-10-30 11:34:52', '2018-10-30 11:34:52');
INSERT INTO `resume` VALUES ('16', 'XgRpyZVGtzVxIaim', 'test014', '文艺清新', '文艺清新', '', '1540951660.jpg', '0', '944', '843', '823', '2018-10-30 17:41:07', '2018-10-30 11:35:08');
INSERT INTO `resume` VALUES ('17', 'CsPVopgpKJoxOpQa', 'test015', '', '经典大气', '', '1540951660.jpg', '0', '910', '951', '821', '2018-10-30 17:45:46', '2018-10-30 17:45:46');
INSERT INTO `resume` VALUES ('18', 'IdWtRSMVHQdimBXQ', 'test016', '', '文艺清新', '', '1540951660.jpg', '0', '1051', '1237', '1120', '2018-10-31 10:07:42', '2018-10-30 17:48:10');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `uid` varchar(32) DEFAULT NULL,
  `account` varchar(32) DEFAULT NULL,
  `type` int(4) DEFAULT '0' COMMENT '账号类型',
  `password` varchar(64) DEFAULT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `email` varchar(32) DEFAULT NULL,
  `gender` varchar(8) DEFAULT NULL,
  `name` varchar(32) DEFAULT NULL,
  `birthday` varchar(255) NOT NULL DEFAULT '',
  `avatar` varchar(64) DEFAULT NULL,
  `actived` int(2) DEFAULT '0',
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', '', 'root2018', '3', 'pbhANIi1ZWv3ex9Jdet7nrs4ZkT6/Fz9WDDoTOE0IyU=', '13922305912', 'imsprojo2fan@foxmail.com', '男', '', '', '666666', '1', '2018-11-11 14:11:30', '2018-11-06 17:12:27');
INSERT INTO `user` VALUES ('9', 'rNQCpJhFOAJPWiod', 'test002', '0', 'pbhANIi1ZWv3ex9Jdet7nrs4ZkT6/Fz9WDDoTOE0IyU=', '13641531654', 'test@qq.com', '女', '看风了风', '2001-01-01', '', '0', '2018-11-14 16:15:05', '2018-11-14 16:15:05');
INSERT INTO `user` VALUES ('10', 'nZpaNTAUqwVXHfTK', '', '0', '', '18306178806', '894355679@qq.com', '女', '陈雨', '1995-02-17', '', '0', '2018-11-14 19:20:32', '2018-11-14 19:20:32');
INSERT INTO `user` VALUES ('11', 'whQeBHMudNSHAWOo', '', '0', '', '13656545641', 'test@qq.com', '女', '看风了风', '1996-01-01', '', '0', '2018-11-15 10:12:09', '2018-11-15 10:12:09');
INSERT INTO `user` VALUES ('14', 'fBpJKikNwWvYKHHz', '', '0', '', '13613465131', 'test@qq.com', '男', '看风了风', '2018-01-01', '', '0', '2018-11-22 15:29:11', '2018-11-22 15:29:11');
INSERT INTO `user` VALUES ('15', 'XNlNSusnnlphZtnt', '', '0', '', '13646151651', 'test@qq.com', '男', '看风了风', '2018-01-01', '', '0', '2018-11-23 14:49:13', '2018-11-23 14:49:13');
INSERT INTO `user` VALUES ('16', 'FnVHKHfSoQlOocMd', '', '0', '', '13646515615', 'test@qq.com', '男', '55646416', '2018-01-01', '', '0', '2018-11-23 17:18:21', '2018-11-23 17:18:21');
INSERT INTO `user` VALUES ('17', 'aNLuIDJbxlUiKPZn', '', '0', '', '13646135115', 'test@qq.com', '男', '看风了风', '2018-01-10', '', '0', '2018-11-29 15:58:55', '2018-11-29 15:58:55');
INSERT INTO `user` VALUES ('18', 'QfKtUQHqvqPjLMcC', '', '0', '', '13656545641', 'test@qq.com', '男', '看风了风', '1995-01-01', '', '0', '2018-12-07 10:46:35', '2018-12-07 10:46:35');
INSERT INTO `user` VALUES ('19', 'BlojoCeosTEynqtX', '', '0', '', '13656545641', 'test@qq.com', '男', '看风了风', '1995-01-01', '', '0', '2018-12-29 11:27:15', '2018-12-29 11:27:15');
INSERT INTO `user` VALUES ('20', 'qQBEktzUwQFRDfhb', '', '0', '', '15132362556', '4546526356@qq.com', '男', 'cc', '2018-01-01', '', '0', '2019-01-10 11:38:34', '2019-01-10 11:38:34');
INSERT INTO `user` VALUES ('21', 'iDPoDlCLZVwgdekm', '', '0', '', '13459934647', '1123332@qq.com', '男', '1', '2018-01-01', '', '0', '2019-01-10 11:57:06', '2019-01-10 11:57:06');
INSERT INTO `user` VALUES ('22', '', '123456', '0', 'WK44Qvrks9zhKlZye3oVmAfzE4mHvPMhNYrdCfjfETQ=', '13459934647', '123@qq.com', '男', 'wang', '2018-01-01', '', '0', '2019-01-24 17:02:53', '2019-01-11 04:43:38');
INSERT INTO `user` VALUES ('23', 'TwSHXPTyHyCUDJfn', '', '0', '', '13459934647', '55@qq.com', '男', '1', '2018-01-01', '', '0', '2019-01-10 14:28:14', '2019-01-10 14:28:14');
INSERT INTO `user` VALUES ('24', 'MxkspmixPQVrEPit', '', '0', '', '13333333333', 'imsprojo2fan@foxmail.com8', '女', '范范', '2018-01-05', '', '1', '2019-01-10 14:56:49', '2019-01-10 14:56:49');
INSERT INTO `user` VALUES ('25', 'uxJLJUqGduNeZqzx', '', '0', '', '13646416165', 'test@qq.com', '男', '84168', '2018-01-01', '', '0', '2019-01-12 10:42:30', '2019-01-12 10:42:30');
INSERT INTO `user` VALUES ('26', 'jOtojWhyYZEfmOrm', '', '0', '', '13655615165', 'test@qq.com', '男', '8416651', '2018-01-01', '', '0', '2019-01-12 10:44:28', '2019-01-12 10:44:28');
INSERT INTO `user` VALUES ('27', 'WTaKjhZLyswtAOpF', '', '0', '', '13645156165', 'test@qq.com', '男', '89468416', '2018-01-01', '', '0', '2019-01-12 10:45:50', '2019-01-12 10:45:50');
INSERT INTO `user` VALUES ('28', 'vFSEqhMMmJQKUqKC', '', '0', '', '13646416416', 'test@qq.com', '男', '896165', '2018-01-01', '', '0', '2019-01-12 10:48:59', '2019-01-12 10:48:59');
INSERT INTO `user` VALUES ('29', 'WGzdpSykjAxwwCMK', '', '0', '', '13646416516', 'test@qq.com', '男', '8964165', '2018-01-01', '', '0', '2019-01-12 10:51:56', '2019-01-12 10:51:56');
INSERT INTO `user` VALUES ('30', 'ecPRWuNFrXwuXrpr', '', '0', '', '13646516516', 'test@qq.com', '男', '8641651', '2018-01-01', '', '0', '2019-01-12 10:55:36', '2019-01-12 10:55:36');
INSERT INTO `user` VALUES ('31', 'SjHElHRBozUkKLlp', '', '0', '', '13646541651', 'test@qq.com', '男', '616516', '2018-01-01', '', '0', '2019-01-12 10:58:02', '2019-01-12 10:58:02');
INSERT INTO `user` VALUES ('32', 'wEQNgkNZstILNkgX', '', '0', '', '13646514651', 'test@qq.com', '男', '46416', '2018-01-01', '', '0', '2019-01-12 11:04:48', '2019-01-12 11:04:48');

-- ----------------------------
-- Table structure for `wxinfo`
-- ----------------------------
DROP TABLE IF EXISTS `wxinfo`;
CREATE TABLE `wxinfo` (
  `id` int(16) NOT NULL AUTO_INCREMENT,
  `uid` varchar(64) DEFAULT NULL,
  `openid` varchar(64) DEFAULT '' COMMENT '微信openid',
  `unionid` varchar(64) DEFAULT '' COMMENT '微信unionid',
  `account` varchar(32) DEFAULT NULL COMMENT '账号',
  `phone` varchar(255) NOT NULL DEFAULT '',
  `email` varchar(32) DEFAULT NULL COMMENT '电子邮箱',
  `nick_name` varchar(128) NOT NULL DEFAULT '',
  `avatar` varchar(128) DEFAULT '' COMMENT '头像',
  `gender` varchar(4) DEFAULT '0' COMMENT '0未知 1男 2女',
  `country` varchar(16) DEFAULT '' COMMENT '国家',
  `province` varchar(16) DEFAULT '' COMMENT '省份',
  `city` varchar(16) DEFAULT '' COMMENT '城市',
  `updated` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  `type` int(11) NOT NULL DEFAULT '0',
  `password` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8 COMMENT='微信信息记录表';

-- ----------------------------
-- Records of wxinfo
-- ----------------------------
INSERT INTO `wxinfo` VALUES ('5', null, 'o3lQf5fxpmuZo-IDjI5vjZIqJ2Mc', '', 'root', '13922305912', 'imsprojo2fan@foxmail.com', '', 'https://wx.qlogo.cn/mmopen/vi_32/ljCCvMWpjohMThccH7BGau2SdqOHLu3U2u9y5kNkcygqhGkad9RuJu21zT1VR1CUCjymIKoqE9W8dVW9xLfIEQ/132', '1', '', 'Fujian', 'Xiamen', null, '2018-09-09 13:51:56', '0', '');
INSERT INTO `wxinfo` VALUES ('21', 'aIMpWyahjvvKPQdF', '', '', '', '', '', '', '', '', '', '', '', '2018-11-05 16:32:40', '2018-11-05 16:32:40', '0', '');
